{
  "contact_information": {
    "name": "Teyana Naik",
    "email": "teja.naik@gmail.com",
    "phone": "7337551063",
    "location": "Hyderabad, India"
  },
  "professional_summary": "Highly skilled AI/ML Engineer with extensive experience in designing, deploying, and optimizing machine learning models for healthcare applications. Proven expertise in deep learning, NLP, and computer vision, with a focus on healthcare AI pipeline development and implementation. Seeking a challenging role leveraging expertise in data analysis, model evaluation, and production deployment.",
  "work_experience": [
    {
      "company": "Microline Information Systems Pvt Ltd",
      "role": "AI/ML Engineer",
      "duration": "September 2024 – Current",
      "responsibilities": [
        "Designed and deployed end-to-end healthcare AI pipelines using Machine Learning, Deep Learning, Python, TensorFlow/Keras, and Computer Vision to enable scalable analysis of high-resolution Whole Slide Images (WSIs).",
        "Developed and optimized deep learning CNN models for nuclei detection and counting using YOLO, U-Net, and Mask R-CNN, significantly reducing manual pathology workload and improving quantitative diagnostic accuracy.",
        "Built Machine Learning and Deep Learning–based CNN classification models to distinguish cancerous and non-cancerous tissue regions, delivering consistent performance across heterogeneous histopathology datasets.",
        "Implemented data augmentation, normalization, and class imbalance handling techniques to improve model robustness, generalization, and clinical reliability in medical image analysis.",
        "Engineered WSI preprocessing and data pipelines using Python, OpenCV, and NumPy, converting raw .svs and .tif slides into training-ready datasets for machine learning and deep learning models."
      ],
      "is_project": false
    },
    {
      "company": "Cherish HR Services Pvt Ltd",
      "role": "Sr. Python Developer",
      "duration": "May 2024 – August 2024",
      "responsibilities": [
        "Developed and integrated RESTful APIs using Fast API (Python) for scalable web applications, data processing, and model-driven services.",
        "Deployed and managed cloud-native applications on AWS (Lambda, EC2, S3), enabling reliable backend services and support for machine learning inference.",
        "Designed and deployed backend and web services on cloud platforms using Docker for containerized, repeatable, and efficient deployments.",
        "Diagnosed and resolved file system, data flow, and application issues by analyzing logs and implementing corrective actions to maintain system stability.",
        "Collaborated with frontend engineers, data/ML teams, designers, and QA to ensure smooth integration and adherence to engineering best practices.",
        "Participated in code reviews, sprint planning, and Agile ceremonies, contributing to clean code, maintainability, and high delivery standards.",
        "Monitored and maintained production applications, addressing bugs, applying updates, and improving performance and reliability.",
        "Partnered with technical leads and architects to align on technical direction and deliver scalable, robust backend solutions."
      ],
      "is_project": true
    },
    {
      "company": "Verity Technologies Pvt. Ltd.",
      "role": "Python Software Developer",
      "duration": "December 2019 – April 2024",
      "responsibilities": [
        "Developed and integrated RESTful APIs using Fast API (Python) to support scalable web applications, data processing, and model-driven services.",
        "Deployed and managed cloud-native applications on AWS (Lambda, EC2, S3), enabling reliable backend services and support for machine learning inference.",
        "Designed and deployed backend and web services on cloud platforms using Docker for containerized, repeatable, and efficient deployments.",
        "Implemented order lifecycle workflows including payment capture, webhook handling, and signature verification to ensure transaction integrity and reliability.",
        "Optimized database queries and data models using Django ORM, improving performance, scalability, and readiness for ranking or recommendation logic.",
        "Implemented search and filtering functionality for products, supporting relevance-based results and future ML-driven enhancements.",
        "Configured Celery and Redis for asynchronous processing such as order confirmations, inventory updates, and background jobs.",
        "Deployed and maintained the application using Docker and AWS EC2, ensuring high availability, scalability, and production stability."
      ],
      "is_project": false
    }
  ],
  "education": [],
  "skills": [],
  "certifications": [
    "Python for Machine Learning and Data Science – Certified by Simplilearn",
    "Machine Learning – Certified by Simplilearn",
    "Machine Learning – Certified by Coursera (Andrew Ng)",
    "Deep Learning - Certified by Simplilearn",
    "Natural Language Processing - Certified by Simplilearn",
    "IBM Artificial Intelligence Engineer Master Program – Certified by Simplilearn"
  ]
}